app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "favorite", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["favorite", "f"], ["created_at", "2020-07-19 19:29:13.376097"], ["updated_at", "2020-07-19 19:29:13.376097"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = $1, "favorite" = $2, "updated_at" = $3 WHERE "categories"."id" = $4  [["name", "Programação"], ["favorite", "t"], ["updated_at", "2020-07-19 19:52:06.900270"], ["id", 4]]