app/controllers/videos_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."video_id" = $1  [["video_id", 2]]
---
  def show
    @comments = Comment.where(video_id: params[:id])

INSERT INTO "videos" ("title", "youtube_url", "category_id", "youtube_embed_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "a"], ["youtube_url", "a"], ["category_id", 2], ["youtube_embed_id", "a"], ["created_at", "2020-07-19 23:52:29.637003"], ["updated_at", "2020-07-19 23:52:29.637003"]]
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

UPDATE "videos" SET "youtube_url" = $1, "youtube_embed_id" = $2, "updated_at" = $3 WHERE "videos"."id" = $4  [["youtube_url", "PzpCnd-HWf4"], ["youtube_embed_id", "https://www.youtube.com/watch?v="], ["updated_at", "2020-07-19 21:00:53.108268"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @video.update(video_params)

SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" INNER JOIN "videos" ON "videos"."category_id" = "categories"."id" WHERE "categories"."favorite" = $1  [["favorite", "t"]]
SELECT "videos".* FROM "videos" INNER JOIN "categories" ON "categories"."id" = "videos"."category_id" WHERE (categories.favorite = 't') GROUP BY "videos"."category_id"
---
  def favorites
    @categories = Category.all
    @favorites = Video.joins(:category).where("categories.favorite = ?", true).group_by(&:category)

SELECT "categories".* FROM "categories"
SELECT  "categories"."name" FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "videos".* FROM "videos" WHERE "videos"."category_id" = $1  [["category_id", 2]]
---
  def by_category
    @categories = Category.all
    @category = Category.select(:name).find(params[:id]).name
    @videos = Video.where(category_id: params[:id])

INSERT INTO "comments" ("author", "text", "video_id", "created_at", "updated_at", "date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author", "Rafinha"], ["text", "tem que crescer sem medo"], ["video_id", 2], ["created_at", "2020-07-20 00:49:18.461157"], ["updated_at", "2020-07-20 00:49:18.461157"], ["date", "2020-07-19"]]
SELECT "comments".* FROM "comments" WHERE "comments"."video_id" = $1  [["video_id", 2]]
---
  def create_comment
    @comment = Comment.new
    @comment.author = params[:author]
    @comment.text = params[:text]
    @comment.video_id = params[:video_id]
    @comment.save!

    @comments = Comment.where(video_id: params[:video_id])